Revit 2027 API
BuiltInFailures.FamilyFailures.UnableToUpgradeDueToCorruptFamilies Property
 Some families have become unusable. Reload the families, or delete them from the model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnableToUpgradeDueToCorruptFamilies { get; }
Public Shared ReadOnly Property UnableToUpgradeDueToCorruptFamilies As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnableToUpgradeDueToCorruptFamilies {
	FailureDefinitionId^ get ();
}
static member UnableToUpgradeDueToCorruptFamilies : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace